Documents/bibliography.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Skyler Turner's EPQ</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.min.css" /><link rel="stylesheet" href="/custom.css" />
</head>
<body>
<div id="preamble" class="status">

<div class="header">
    <span class="title">Skyler Turner's EPQ</span>
    <div class="links">
        <a href="/">Home</a>
        <a href="/Notes/daily/2021-11-28.html">Latest daily</a>
        <a href="https://github.com/Minion3665/EPQ/issues/new">Report issue</a>
        <a href="https://github.com/Minion3665/EPQ">View source</a>
    </div>
</div>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#example">Example Work</a></li>
<li><a href="#docker_faq_lxc">Docker FAQ, 'What does Docker technology add to just plain LXC?'</a></li>
<li><a href="#mailcow_unsupported_nesting">Mailcow dockerized,'running in nested containers is not supported'</a></li>
<li><a href="#docker_on_what_is_containerd">Containerd was made for docker</a></li>
<li><a href="#containers_are_not_kernel_objects_article">Containers are not kernel objects</a></li>
<li><a href="#containers_are_not_kernel_objects_email">Containers are not kernel objects (mailing list archive)</a></li>
<li><a href="#harvard_citation_style">Harvard style isn't a single citation style</a></li>
<li><a href="#so_dev_survey_2021">The stackoverflow developer survey (2021)</a></li>
<li><a href="#so_dev_survey_2020">The stackoverflow developer survey (2020)</a></li>
<li><a href="#so_dev_survey_2019">The stackoverflow developer survey (2019)</a></li>
<li><a href="#discord_py_closing_announcement">Discord.py ends</a></li>
</ul>
</div>
</div>

<div id="outline-container-example" class="outline-2">
<h2 id="example">Example Work</h2>
<div class="outline-text-2" id="text-example">
<pre class="example">
TITLE: Example Work
BTYPE: book
AUTHOR: Skyler Turner
PUBLISHER: Clicks Minute Publishing^{TM}
YEAR: 2015
CUSTOM_ID: example
</pre>
</div>
</div>

<div id="outline-container-docker_faq_lxc" class="outline-2">
<h2 id="docker_faq_lxc">Docker FAQ, 'What does Docker technology add to just plain LXC?'</h2>
<div class="outline-text-2" id="text-docker_faq_lxc">
<pre class="example">
TITLE: Docker FAQ, 'What does Docker technology add to just plain LXC?'
BTYPE: online
url: https://docs.docker.com/engine/faq/#what-does-docker-technology-add-to-just-plain-lxc
author: Docker Inc.
urldate: <2021-11-19 Fri>
CUSTOM_ID: docker_faq_lxc
</pre>
</div>
</div>

<div id="outline-container-mailcow_unsupported_nesting" class="outline-2">
<h2 id="mailcow_unsupported_nesting">Mailcow dockerized,'running in nested containers is not supported'</h2>
<div class="outline-text-2" id="text-mailcow_unsupported_nesting">
<pre class="example">
TITLE: Mailcow dockerized,'running in nested containers is not supported'
BTYPE: online
url: https://mailcow.github.io/mailcow-dockerized-docs/prerequisite-system/
author: andryyy
urldate: <2021-11-21 Sun>
CUSTOM_ID: mailcow_unsupported_nesting
</pre>
</div>
</div>

<div id="outline-container-docker_on_what_is_containerd" class="outline-2">
<h2 id="docker_on_what_is_containerd">Containerd was made for docker</h2>
<div class="outline-text-2" id="text-docker_on_what_is_containerd">
<pre class="example">
TITLE: Docker blog, 'What is containerd?'
BTYPE: online
url: https://www.docker.com/blog/what-is-containerd-runtime/
author: Michael Crosby
urldate: <2021-11-22 Mon>
year: 2017
month: August
CUSTOM_ID: docker_on_what_is_containerd
</pre>
</div>
</div>

<div id="outline-container-containers_are_not_kernel_objects_article" class="outline-2">
<h2 id="containers_are_not_kernel_objects_article">Containers are not kernel objects</h2>
<div class="outline-text-2" id="text-containers_are_not_kernel_objects_article">
<pre class="example">
TITLE: LWN archive, 'Containers as kernel objects — again'
BTYPE: online
url: https://lwn.net/Articles/780364/
author: Jonathan Corbet
urldate: <2021-11-22 Mon>
year: 2019
month: February
CUSTOM_ID: containers_are_not_kernel_objects_article
</pre>
</div>
</div>

<div id="outline-container-containers_are_not_kernel_objects_email" class="outline-2">
<h2 id="containers_are_not_kernel_objects_email">Containers are not kernel objects (mailing list archive)</h2>
<div class="outline-text-2" id="text-containers_are_not_kernel_objects_email">
<pre class="example">
TITLE: email archive, (LKML archive, Re: [RFC PATCH 02/27] containers: Implement containers as kernel objects)
BTYPE: online
url: https://www.mail-archive.com/linux-kernel@vger.kernel.org/msg1936761.html
author: James Bottomley
urldate: <2021-11-22 Mon>
year: 2019
month: February
CUSTOM_ID: containers_are_not_kernel_objects_email
</pre>
</div>
</div>

<div id="outline-container-harvard_citation_style" class="outline-2">
<h2 id="harvard_citation_style">Harvard style isn't a single citation style</h2>
<div class="outline-text-2" id="text-harvard_citation_style">
<pre class="example">
TITLE: Harvard Style, learn to cite
BTYPE: online
url: https://libguides.mjc.edu/c.php?g=255746&p=3205500
author: Modesto Junior College
urldate: <2021-11-22 Mon>
year: 2021
month: November
CUSTOM_ID: harvard_citation_style
</pre>
</div>
</div>

<div id="outline-container-so_dev_survey_2021" class="outline-2">
<h2 id="so_dev_survey_2021">The stackoverflow developer survey (2021)</h2>
<div class="outline-text-2" id="text-so_dev_survey_2021">
<pre class="example">
TITLE: The Stackoverflow developer survey (2021)
BTYPE: online
url: https://insights.stackoverflow.com/survey/2021
author: Prosus N.V.
urldate: <2021-11-28 Sun>
year: 2021
month: May
CUSTOM_ID: so_dev_survey_2021
</pre>
</div>
</div>

<div id="outline-container-so_dev_survey_2020" class="outline-2">
<h2 id="so_dev_survey_2020">The stackoverflow developer survey (2020)</h2>
<div class="outline-text-2" id="text-so_dev_survey_2020">
<pre class="example">
TITLE: The Stackoverflow developer survey (2020)
BTYPE: online
url: https://insights.stackoverflow.com/survey/2020
author: Prosus N.V.
urldate: <2021-11-28 Sun>
year: 2020
month: February
CUSTOM_ID: so_dev_survey_2020
</pre>
</div>
</div>

<div id="outline-container-so_dev_survey_2019" class="outline-2">
<h2 id="so_dev_survey_2019">The stackoverflow developer survey (2019)</h2>
<div class="outline-text-2" id="text-so_dev_survey_2019">
<pre class="example">
TITLE: The Stackoverflow developer survey (2019)
BTYPE: online
url: https://insights.stackoverflow.com/survey/2019
author: Prosus N.V.
urldate: <2021-11-28 Sun>
year: 2019
CUSTOM_ID: so_dev_survey_2019
</pre>
</div>
</div>

<div id="outline-container-discord_py_closing_announcement" class="outline-2">
<h2 id="discord_py_closing_announcement">Discord.py ends</h2>
<div class="outline-text-2" id="text-discord_py_closing_announcement">
<pre class="example">
TITLE: The future of discord.py
BTYPE: online
url: https://gist.github.com/Rapptz/4a2f62751b9600a31a0d3c78100287f1
author: Rapptz
urldate: <2021-11-28 Sun>
year: 2021
month: August
CUSTOM_ID: discord_py_closing_announcement
</pre>
</div>
</div>
</div>
</body>
</html>
